run/sandiaPropaneJet/model/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solver             multicomponentFluid;

startFrom          latestTime;

startTime          0;

stopAt             endTime;

endTime            10000;

deltaT             1;

writeControl       runTime;

writeInterval      50;

purgeWrite         4;

writeFormat        ascii;

writePrecision     6;

writeCompression   off;

timeFormat         general;

timePrecision      6;

runTimeModifiable  true;

// ************************************************************************* //