run/sandiaPropaneJet/model/system/library/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

patches
{
    inletFuel
    {
        patchInfo
        {
            type patch;
        }
        constructFrom set;
        set inletFuelFaces;
    }

    inletCoflow
    {
        patchInfo
        {
            type patch;
        }
        constructFrom set;
        set inletCoflowFaces;
    }
}

// ************************************************************************* //
