run/sandiaPropaneJet/model/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeEtc "caseDicts/mesh/generation/snappyHexMeshDict.cfg"

castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    // ---------------------------------------------------------------
    // Actual geometry
    // ---------------------------------------------------------------

    inletCoflow
    {
        type triSurfaceMesh;
        file "inletCoflow.stl";
    }
    inletFuel
    {
        type triSurfaceMesh;
        file "inletFuel.stl";
    }
    pipeEndWall
    {
        type triSurfaceMesh;
        file "pipeEndWall.stl";
    }
    pipeInnerWall
    {
        type triSurfaceMesh;
        file "pipeInnerWall.stl";
    }
    pipeOuterWall
    {
        type triSurfaceMesh;
        file "pipeOuterWall.stl";
    }

    // ---------------------------------------------------------------
    // Meshing auxiliaries
    // ---------------------------------------------------------------

    refinementCylinderTip
    {
        type cylinder;
        point1 (0.0  0.0 -0.06);
        point2 (0.0  0.0  0.05);
        radius 0.008;
    }
    refinementCylinderMain
    {
        type cylinder;
        point1 (0.0  0.0  0.00);
        point2 (0.0  0.0  0.25);
        radius 0.025;
    }
}

castellatedMeshControls
{
    // Point inside fluid volume, used to crop the background mesh.
    insidePoint (0 0 1);

    // The maximum number of cells allowed per processor during
    // the refinement stage.
    maxLocalCells 100000;

    // The overall cell limit across all processors during refinement,
    // applied before the cell removal stage.
    maxGlobalCells 4500000;

    // The threshold for stopping surface refinement; if the number of
    // cells targeted for refinement falls below this number, surface
    // refinement stops.
    minRefinementCells 20000;

    // This specifies the number of buffer layers of cells that must exist
    // between successive levels of mesh refinement (typically set to 3 to
    // ensure a smooth transition).
    nCellsBetweenLevels  3;

    // Resolve feature angle; if this value is too high (e.g., set to 100),
    // the mesher will ignore sharp angle intersections, leading to a
    // highly distorted castellated grid at the corners. Keep default.
    resolveFeatureAngle 30;

    features
    (
        {
            file "inletCoflow.eMesh";
            level 3;
        }
        {
            file "inletFuel.eMesh";
            level 3;
        }
        {
            file "pipeEndWall.eMesh";
            level 3;
        }
        {
            file "pipeInnerWall.eMesh";
            level 3;
        }
        {
            file "pipeOuterWall.eMesh";
            level 3;
        }
    );

    refinementSurfaces
    {
        inletCoflow
        {
            level (1 2);
            patchInfo
            {
                type patch;
            }
        }
        inletFuel
        {
            level (4 4);
            patchInfo
            {
                type patch;
            }
        }
        pipeEndWall
        {
            level (4 4);
            patchInfo
            {
                type wall;
            }
        }
        pipeInnerWall
        {
            level (4 4);
            patchInfo
            {
                type wall;
            }
        }
        pipeOuterWall
        {
            level (4 4);
            patchInfo
            {
                type wall;
            }
        }
    }

    refinementRegions
    {
        refinementCylinderTip
        {
            mode distance;
            levels (
                (0.008 4)
                (0.020 3)
            );
        }
        refinementCylinderMain
        {
            mode distance;
            levels (
                (0.025 2)
                (0.050 1)
            );
        }
    }
}

snapControls
{
    // Specifies the number of patch smoothing iterations performed
    // before finding the correspondence to the surface (typically
    // set to 3).
    // This specifies the number of patch smoothing iterations performed
    // before finding the correspondence to the surface (typically
    // set to 3).
    nSmoothPatch 3;

    // The ratio of the distance for points to be attracted by a
    // surface feature point or edge, to the local maximum edge length
    // (typically set to 2.0). Increasing produces a sharper snapping.
    tolerance 1.0;

    // The number of mesh displacement relaxation iterations (typically
    // in the range of 30 to 100).
    nSolveIter 300;

    // The maximum number of snapping relaxation iterations (typically
    // set to 5).
    nRelaxIter 5;

    // This specifies the number of feature edge snapping iterations. It
    // dictates how many passes the snapping driver executes to align
    // nodes directly with sharp feature lines. Leaving it out or
    //setting it to 0 completely disables sharp feature edge snapping.
    nFeatureSnapIter 10;

    // When set to true (the default), the snapping driver uses
    // explicitly defined feature lines (File-Based Snapping) loaded
    // in the castellatedMeshControls.features dictionary (typically
    // .eMesh files generated by the surfaceFeatures utility).
    explicitFeatureSnap true;

    // When set to true, the mesh generator implicitly detects
    // geometric features by dynamically sampling the surface.
    implicitFeatureSnap true;

    // Allow snapping to feature lines in multiple regions. Required for
    // resolving angle between inlet and the pipe walls, as they are in
    // separate patches.
    multiRegionFeatureSnap true;
}

addLayersControls
{
    layers
    {
        ductWalls
        {
            nSurfaceLayers 3;
        }
        pipeEndWall
        {
            nSurfaceLayers 4;
        }
        pipeOuterWall
        {
            nSurfaceLayers 4;
        }
        pipeInnerWall
        {
            nSurfaceLayers 4;
        }
    }

    relativeSizes       true;
    expansionRatio      1.2;
    finalLayerThickness 0.3;
    minThickness        0.05;
}

// ************************************************************************* //