run/sandiaPropaneJet/model/constant/chemistry/reactions
reactions
{
    un-named-reaction-0
    {
        type            irreversibleArrhenius;
        reaction        "C3H8^0.1 + 1.5O2^1.65 = 3CO + 4H2";
        A               5.342242589e+10;
        beta            0;
        Ta              15095.73717;
    }
    un-named-reaction-1
    {
        type            reversibleArrhenius;
        reaction        "H + O2 = O + OH";
        A               2.2e+11;
        beta            0;
        Ta              8453.612812;
    }
    un-named-reaction-2
    {
        type            reversibleArrhenius;
        reaction        "H2 + O = H + OH";
        A               18000000;
        beta            1;
        Ta              4478.402026;
    }
    un-named-reaction-3
    {
        type            reversibleArrhenius;
        reaction        "H2O + O = 2OH";
        A               6.8e+10;
        beta            0;
        Ta              9258.718795;
    }
    un-named-reaction-4
    {
        type            reversibleArrhenius;
        reaction        "H2 + OH = H + H2O";
        A               2.2e+10;
        beta            0;
        Ta              2566.275318;
    }
    un-named-reaction-5
    {
        type            reversibleThirdBodyArrhenius;
        reaction        "H + O2 = HO2";
        A               1500000000;
        beta            0;
        Ta              -503.1912388;
        coeffs          
12
(
(H 1)
(H2 1)
(O 1)
(OH 1)
(H2O 1)
(CO 1)
(N2 1)
(O2 1)
(HO2 1)
(H2O2 1)
(CO2 1)
(C3H8 1)
)
;
    }
    un-named-reaction-6
    {
        type            reversibleArrhenius;
        reaction        "HO2 + O = O2 + OH";
        A               5e+10;
        beta            0;
        Ta              503.1912388;
    }
    un-named-reaction-7
    {
        type            reversibleArrhenius;
        reaction        "H + HO2 = 2OH";
        A               2.5e+11;
        beta            0;
        Ta              956.0633538;
    }
    un-named-reaction-8
    {
        type            reversibleArrhenius;
        reaction        "H + HO2 = H2 + O2";
        A               2.5e+10;
        beta            0;
        Ta              352.2338672;
    }
    un-named-reaction-9
    {
        type            reversibleArrhenius;
        reaction        "HO2 + OH = H2O + O2";
        A               5e+10;
        beta            0;
        Ta              503.1912388;
    }
    un-named-reaction-10
    {
        type            reversibleArrhenius;
        reaction        "2HO2 = H2O2 + O2";
        A               1e+10;
        beta            0;
        Ta              503.1912388;
    }
    un-named-reaction-11
    {
        type            reversibleThirdBodyArrhenius;
        reaction        "H2O2 = 2OH";
        A               1.2e+14;
        beta            0;
        Ta              22895.20137;
        coeffs          
12
(
(H 1)
(H2 1)
(O 1)
(OH 1)
(H2O 1)
(CO 1)
(N2 1)
(O2 1)
(HO2 1)
(H2O2 1)
(CO2 1)
(C3H8 1)
)
;
    }
    un-named-reaction-12
    {
        type            reversibleArrhenius;
        reaction        "H2 + HO2 = H + H2O2";
        A               730000000;
        beta            0;
        Ta              9409.676166;
    }
    un-named-reaction-13
    {
        type            reversibleArrhenius;
        reaction        "H2O2 + OH = H2O + HO2";
        A               1e+10;
        beta            0;
        Ta              905.7442299;
    }
    un-named-reaction-14
    {
        type            reversibleArrhenius;
        reaction        "CO + OH = CO2 + H";
        A               15000;
        beta            1.3;
        Ta              -402.5529911;
    }
    un-named-reaction-15
    {
        type            reversibleArrhenius;
        reaction        "CO + O2 = CO2 + O";
        A               310000000;
        beta            0;
        Ta              18919.99058;
    }
    un-named-reaction-16
    {
        type            reversibleThirdBodyArrhenius;
        reaction        "CO + O = CO2";
        A               5900000000;
        beta            0;
        Ta              2063.084079;
        coeffs          
12
(
(H 1)
(H2 1)
(O 1)
(OH 1)
(H2O 1)
(CO 1)
(N2 1)
(O2 1)
(HO2 1)
(H2O2 1)
(CO2 1)
(C3H8 1)
)
;
    }
    un-named-reaction-17
    {
        type            reversibleArrhenius;
        reaction        "CO + HO2 = CO2 + OH";
        A               1.5e+11;
        beta            0;
        Ta              11925.63236;
    }
    un-named-reaction-18
    {
        type            reversibleThirdBodyArrhenius;
        reaction        "OH = H + O";
        A               8e+16;
        beta            -1;
        Ta              52180.93147;
        coeffs          
12
(
(H 1)
(H2 1)
(O 1)
(OH 1)
(H2O 1)
(CO 1)
(N2 1)
(O2 1)
(HO2 1)
(H2O2 1)
(CO2 1)
(C3H8 1)
)
;
    }
    un-named-reaction-19
    {
        type            reversibleThirdBodyArrhenius;
        reaction        "O2 = 2O";
        A               5.1e+12;
        beta            0;
        Ta              57866.99247;
        coeffs          
12
(
(H 1)
(H2 1)
(O 1)
(OH 1)
(H2O 1)
(CO 1)
(N2 1)
(O2 1)
(HO2 1)
(H2O2 1)
(CO2 1)
(C3H8 1)
)
;
    }
    un-named-reaction-20
    {
        type            reversibleThirdBodyArrhenius;
        reaction        "H2 = 2H";
        A               2.2e+11;
        beta            0;
        Ta              48306.35893;
        coeffs          
12
(
(H 1)
(H2 1)
(O 1)
(OH 1)
(H2O 1)
(CO 1)
(N2 1)
(O2 1)
(HO2 1)
(H2O2 1)
(CO2 1)
(C3H8 1)
)
;
    }
    un-named-reaction-21
    {
        type            reversibleThirdBodyArrhenius;
        reaction        "H2O = H + OH";
        A               2.2e+13;
        beta            0;
        Ta              52835.08008;
        coeffs          
12
(
(H 1)
(H2 1)
(O 1)
(OH 1)
(H2O 1)
(CO 1)
(N2 1)
(O2 1)
(HO2 1)
(H2O2 1)
(CO2 1)
(C3H8 1)
)
;
    }
}
Tlow            300;
Thigh           5000;

