run/sandiaPropaneJet/model/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inletFuel
    {
        type            fixedValue;
        value           uniform (0.0 0.0 53.0);
    }
    inletCoflow
    {
        type            fixedValue;
        value           uniform (0.0 0.0 9.2);
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }
    "(ductWalls|pipeEndWall|pipeInnerWall|pipeOuterWall)"
    {
        type            noSlip;
    }
}


// ************************************************************************* //
