run/sandiaPropaneJet/model/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 294;

boundaryField
{
    inletFuel
    {
        type            fixedValue;
        value           uniform 294;
    }
    inletCoflow
    {
        type            fixedValue;
        value           uniform 294;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 294;
        value           uniform 294;
    }
    "(ductWalls|pipeEndWall|pipeInnerWall|pipeOuterWall)"
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
