run/sandiaPropaneJet/model/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 100;

boundaryField
{
    inletFuel
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    7.070e-04;
        phi             phi;
        k               k;
        value           uniform 1.690e+05;
    }
    inletCoflow
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    1.750e-03;
        phi             phi;
        k               k;
        value           uniform 3.709e+04;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1000;
        value           uniform 1000;
    }
    "(ductWalls|pipeEndWall|pipeInnerWall|pipeOuterWall)"
    {
        type            epsilonWallFunction;
        value           uniform 1000;
    }
}

// ************************************************************************* //