run/sandiaPropaneJet/model/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 10;

boundaryField
{
    inletFuel
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.004; // FIXME this should be higher, compute!
        value           uniform 1;
    }
    inletCoflow
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.004;
        value           uniform 1;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
    "(ductWalls|pipeEndWall|pipeInnerWall|pipeOuterWall)"
    {
        type            kqRWallFunction;
        value           uniform 1;
    }
}

// ************************************************************************* //