run/sandiaPropaneJet/model/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         localEuler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default          none;

    div(phi,U)       Gauss limitedLinearV 1;
    div(phi,Yi_h)    Gauss limitedLinear 1;
    div(phi,K)       Gauss limitedLinear 1;
    div(phi,k)       Gauss limitedLinear 1;
    div(phi,epsilon) Gauss limitedLinear 1;

    // div(phi,U)       bounded Gauss upwind;
    // div(phi,Yi_h)    Gauss upwind;
    // div(phi,K)       bounded Gauss linear;
    // div(phi,k)       bounded Gauss upwind;
    // div(phi,epsilon) bounded Gauss upwind;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear orthogonal;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         orthogonal;
}

// ************************************************************************* //