run/sandiaPropaneJet/model/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p|rho|G)"
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-6;
        relTol           0.1;
    }

    "(p|rho|G)Final"
    {
        $p;
        relTol           0;
    }

    "(U|h|k|epsilon)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.1;
    }

    "(U|h|k|epsilon)Final"
    {
        $U;
        relTol          0.1;
    }

    "Yi.*"
    {
        $U;
        relTol          0.1;
    }
}

PIMPLE
{
    nCorrectors              2;
    nOuterCorrectors         1;
    nNonOrthogonalCorrectors 0;

    momentumPredictor        yes;
    transonic                no;
    consistent               yes;

    maxCo                    0.5;
    maxDeltaT                1.0e-02;
    // maxCo                    10.0;
    // maxDeltaT                1.0;

    rDeltaTSmoothingCoeff    1;
    rDeltaTDampingCoeff      1;

    alphaTemp                0.05;
    alphaY                   1.0;

    Yref
    {
        O2    0.1;
        C3H8  0.1;
    }

    residualControl
    {
        p               1e-3;
        U               1e-4;
        h               1e-3;
        "(k|epsilon)"   1e-3;
        ".*"            1e-3;
    }
}


relaxationFactors
{
    fields
    {
        p               0.3;
        rho             1.0;
    }

    equations
    {
        U               0.7;
        h               0.7;
        ".*"            0.7;
    }
}

// ************************************************************************* //