run/sandiaPropaneJet/model/system/meshQualityDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      meshQualityDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeEtc "caseDicts/mesh/generation/meshQualityDict.cfg"

relaxed
{
    maxNonOrtho         75;
    minTetQuality       1.0e-30;
    minDeterminant      1.0e-30;
    minFaceWeight       1.0e-30;
    minVolRatio         1.0e-30;
    maxBoundarySkewness 100;
    maxInternalSkewness 100;
}

// ************************************************************************* //